0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
          type            atmBoundaryLayerInletVelocity;
          flowDir              (1 0 0);
          zDir                 (0 0 1); 
          Uref                 25;         
          Zref                 100;           
          z0                   uniform 0.1;
         zGround        	uniform 0.0;
    }
 outlet
    {
               type            pressureInletOutletVelocity;
        value           uniform (0 0 0);

    }
 ground
    {
        type            noSlip;
    }

frontAndBack
{
type symmetry;
}

buildings

{

 type noSlip;
}


 }

// ************************************************************************* //
