0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    inlet
    {
        type            fixedFluxPressure;
    }
  outlet
    {
          type fixedValue ;
       value uniform 101325;

    }
  ground
    {
        type            fixedFluxPressure;
    }

  frontAndBack
    {
        type            symmetry;
    }


buildings 
{
type fixedFluxPressure;
}

   }

// ************************************************************************* //
