0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

kInlet          0.375;   // approx k = 1.5*(I*U)^2 ; I is 10 percent U free 5

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $kInlet;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform $kInlet;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform $kInlet;
        value           uniform $kInlet;
    }

    ground
    {
        type            kqRWallFunction;
        value           uniform $kInlet;
    }



frontAndBack
{
type symmetry;
}

buildings

{
      type            kqRWallFunction;
        value           uniform $kInlet;
}



    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
