0/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      yPlus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    ground
    {
        type            calculated;
        value           nonuniform List<scalar> 
15905
(
36649.7
36649.7
36649.7
36649.6
36649.5
36649.3
36649
36648.5
...
)
;
    }
    frontAndBack
    {
        type            symmetry;
    }
    buildings
    {
        type            calculated;
        value           nonuniform List<scalar> 
318628
(
1313.46
1903.44
2333.5
2996.94
6188.41
5543.91
3599.27
20025.7
...
)
;
    }
}


// ************************************************************************* //
